
let opening1 = "官渡大戰後，曹操打敗了劉備。劉備只得投靠劉表。曹操為得到劉備的謀士徐庶，就謊稱徐庶的母亲病了，讓徐庶立刻去許都。徐庶臨走時告诉劉備，襄陽隆中有个奇才叫諸葛亮，如果能得到他的幫助，就可以得到天下。"
let opening2 = "過了幾天，劉備和關羽。張飛冒着大雪又来到諸葛亮的家。"
let opening3 = "轉眼過了新年，劉備選了個好日子，又一次来到襄陽隆中。"
let result1 = "一顧未見!"
let result2 = "二顧錯過!"
let result3 = "三顧終於請出諸葛亮，最後蜀漢成三方勢力之一，能與之魏、吳相抗衡。"
let visit = 1

    if visit == 1 {
        print(opening1, "誰知諸葛亮剛好出遊去了，書僮也说不準什麼時候回来。劉備只好失望而歸。", result1)
    }
    else if visit == 2 {
        print(opening2, "劉備看見一个青年正在讀書，急忙過去行禮。可那個青年是諸葛亮的弟弟。他告诉劉備，哥哥被朋友邀走了。劉備非常失望，只好留下一封信，說渴望得到諸葛亮的幫助，平定天下。", result2)}
    else  { print(opening3,"諸葛亮正好在睡覺。劉備讓關羽、張飛在門外等候，自己在台階下静静地站着。過了很長時間，諸葛亮才醒来，劉備向他請教平定天下的辦法。諸葛亮给劉備分析了天下的形勢，说：北讓曹操占天時，南讓孫權占地利，將軍可占人和，拿下西川成大業，和曹、孫成三足鼎立之勢。劉備一聽，非常佩服，請求他相助。", result3 )}





